Revit 2027 API
CurveArray.Insert Method
Insert the specified curve into the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	Curve item,
	int index
)
Public Overridable Sub Insert (
	item As Curve,
	index As Integer
)
public:
virtual void Insert(
	Curve^ item,
	int index
)
abstract Insert :
        item : Curve *
        index : int -> unit
override Insert :
        item : Curve *
        index : int -> unit
Parameters
item Curve
The curve to be inserted into the array.
index Int32
The curve will be inserted before this index.
Return Value
Returns whether the curve was inserted into the array.
See Also
Reference
CurveArray Class
Autodesk.Revit.DB Namespace